swimmerCFDcode-in progress/ForceVsOmega/OpenFoamFiles/system/blockMeshDictRef
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (-0.012 -0.012 -0.012) // vertice1
    ( 0.012 -0.012 -0.012) // vertice2
    ( 0.012  0.012 -0.012) // vertice3
    (-0.012  0.012 -0.012) // vertice4
    (-0.012 -0.012  0.012) // vertice5
    ( 0.012 -0.012  0.012) // vertice6
    ( 0.012  0.012  0.012) // vertice7
    (-0.012  0.012  0.012) // vertice8
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (50 50 50) simpleGrading (1 1 1) //blocks
);

edges
(
);

boundary
(
    walls
    {
        type wall;
        faces
        (
            (2 6 5 1)
            (0 3 2 1)
            (0 4 7 3)
            (4 5 6 7)
        );
    }
    inlet
    {
        type patch;
        faces
        (
            (3 7 6 2)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (1 5 4 0)
        );
    }
);

// ************************************************************************* //
